Revit 2027 API
BuiltInFailures.SweepFailures.CannotDrawSweep Property
 Can't create sweep.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawSweep { get; }
Public Shared ReadOnly Property CannotDrawSweep As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawSweep {
	FailureDefinitionId^ get ();
}
static member CannotDrawSweep : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SweepFailures Class
Autodesk.Revit.DB Namespace